Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.SetVendorId(System.String)
Sets the id of the third-party vendor that may access entities of this Schema under the
Vendor acess level, and to generally identify the owner of this Schema.
Remarks:
The vendor id is the registered developer symbol. The registration interface is
available at http://usa.autodesk.com/adsk/servlet/index?siteID=123112&id=1075006
Since vendor ids are not case sensitive, the string will be converted to upper case
before it is stored in the schema.
vendorId:
The vendor id.
Returns:
The SchemaBuilder object may be used to add more settings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The vendorId is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The SchemaBuilder has already finished building the Schema.
Since:
2012

Autodesk.Revit.DB.ExtensibleStorage.SchemaBuilder.VendorIdIsValid(System.String)
Checks whether the supplied vendor id string is valid.
vendorId:
The vendor id to check
Returns:
True if teh vendor id is valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012